Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/External/Incoming/v2/BusinessServices/consultaPasivosCliente_v2/wsdl/ConsultaPasivosCliente_v2.wsdl

<WL5G3N0:definitions name="consultaPasivosClientePS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/consultaPasivosClientePS/" xmlns:WL5G3N0="http://schemas.xmlsoap.org/wsdl/" xmlns:WL5G3N1="http://www.ficohsa.com.hn/middleware.services/consultaClientesTypes" xmlns:WL5G3N2="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:WL5G3N3="http://www.ficohsa.com.hn/middleware.services/consultaPasivosClientePS/" xmlns:WL5G3N4="http://schemas.xmlsoap.org/wsdl/soap/">
  <WL5G3N0:types>
    <xsd:schema xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/consultaClientesTypes" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/consultaPasivosClientePS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
    </xsd:schema>
    <xsd:schema xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/consultaClientesTypes" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/consultaPasivosClientePS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/consultaClientesTypes" schemaLocation="../xsd/consultaPasivosClienteTypes.xsd"/>
    </xsd:schema>
  </WL5G3N0:types>
  <WL5G3N0:message name="consultaPasivosClienteRequest">
    <WL5G3N0:part element="WL5G3N1:consultaPasivosClienteRequest" name="parameters"/>
    <WL5G3N0:part element="WL5G3N2:RequestHeader" name="RequestHeader"/>
  </WL5G3N0:message>
  <WL5G3N0:message name="consultaPasivosClienteResponse">
    <WL5G3N0:part element="WL5G3N1:consultaPasivosClienteResponse" name="result"/>
    <WL5G3N0:part element="WL5G3N2:ResponseHeader" name="ResponseHeader"/>
  </WL5G3N0:message>
  <WL5G3N0:portType name="consultaPasivosClientePS">
    <WL5G3N0:operation name="consultaPasivosCliente" parameterOrder="parameters RequestHeader ResponseHeader">
      <WL5G3N0:input message="WL5G3N3:consultaPasivosClienteRequest"/>
      <WL5G3N0:output message="WL5G3N3:consultaPasivosClienteResponse"/>
    </WL5G3N0:operation>
  </WL5G3N0:portType>
  <WL5G3N0:binding name="consultaPasivosClientePSSOAP" type="WL5G3N3:consultaPasivosClientePS">
    <WL5G3N4:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <WL5G3N0:operation name="consultaPasivosCliente">
      <WL5G3N4:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaPasivosClientePS/consultaPasivosCliente"/>
      <WL5G3N0:input>
        <WL5G3N4:body parts="parameters" use="literal"/>
        <WL5G3N4:header message="WL5G3N3:consultaPasivosClienteRequest" part="RequestHeader" use="literal"/>
      </WL5G3N0:input>
      <WL5G3N0:output>
        <WL5G3N4:body parts="result" use="literal"/>
        <WL5G3N4:header message="WL5G3N3:consultaPasivosClienteResponse" part="ResponseHeader" use="literal"/>
      </WL5G3N0:output>
    </WL5G3N0:operation>
  </WL5G3N0:binding>
  <WL5G3N0:service name="consultaPasivosClientePS">
    <WL5G3N0:port binding="WL5G3N3:consultaPasivosClientePSSOAP" name="consultaPasivosClientePSSOAP">
      <WL5G3N4:address location="https://10.9.104.250:8004/SMiddleware/OperationsAndExecution/PositionManagement/ConsultaPasivosCliente_v2"/>
    </WL5G3N0:port>
  </WL5G3N0:service>
</WL5G3N0:definitions>